app/controllers/listazeljas_controller.rb

INSERT INTO `cuva_zapis` (`id_lista`, `mjesto`, `id_zapis`, `created_at`, `updated_at`) VALUES (1, 0, 4, '2015-12-28 14:41:04', '2015-12-28 14:41:04')
---
	def add
		if @lista_zelja.potvrden then
			flash[:info] = "Lista je već potvrđena i ne možete ju mjenjati. Novu će te moći napraviti sutra."
		else
			if @lista_zelja.cuva_zapis.exists?(:id_zapis => params[:track_index]) then
				flash[:danger] = "Izabrani zapis već postoji na listi."
			else

				if @lista_zelja.cuva_zapis.length == 10 then
					flash[:danger] = "Lista želja je već popunjena."
				else
					if @lista_zelja.cuva_zapis.length == 9 then
						flash[:info] = "Ovim zapisom dosegnuta je maksimalna veličina liste želja. Da biste dodali novi zapis izbrišite neki od trenutnih na listi."
					end
					if @lista_zelja.cuva_zapis.empty? then
						mjesto = 0
					else mjesto = @lista_zelja.cuva_zapis[-1].mjesto + 1
					end
					@lista_zelja.cuva_zapis << CuvaZapi.new(:id_lista => @lista_zelja.id, :mjesto => mjesto, :id_zapis => params[:track_index])

SELECT  `cuva_zapis`.* FROM `cuva_zapis` WHERE `cuva_zapis`.`id_zapis` = 16  ORDER BY `cuva_zapis`.`id` ASC LIMIT 1
DELETE FROM `cuva_zapis` WHERE `cuva_zapis`.`id` = 3
---
	def delete
		if @lista_zelja.potvrden then
			flash[:info] = "Lista je već potvrđena i ne možete ju mjenjati. Novu će te moći napraviti sutra."
		else
			@zapis = CuvaZapi.where(:id_zapis => params[:id_delete], :id_lista => @lista_zelja.id).first
			@zapis.destroy

INSERT INTO `lista_zeljas` (`id_korisnik`, `created_at`, `updated_at`) VALUES (1, '2015-12-28 14:40:37', '2015-12-28 14:40:37')
---
	def load_list
		if ListaZelja.exists?(:id_korisnik => current_user.id) then
			@lista_zelja = ListaZelja.where(:id_korisnik => current_user.id)[-1]
		else
			@lista_zelja = ListaZelja.new(:id_korisnik => current_user.id)
			@lista_zelja.save