app/controllers/tracks_controller.rb

def details
	@track = Track.find(params[:track_id])
---
SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = 4 LIMIT 1

def show
	@@field = params[:search] if params[:search]
	@@name = params[:q] if params[:q]
	@searched_tracks = Track.where(@@field + ' LIKE ?', "%#{@@name}%")
---
SELECT `tracks`.* FROM `tracks` WHERE `tracks`.`name` = '42'